---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.PointLoad
source: html/83085636-e7a6-43f8-d825-c06b69d8f006.htm
---
# PointLoad Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.